package bookbooking;


public class BookList {
	private BookItem[] item = new BookItem[] {
			new BookItem(
					1150,"두 도시 이야기",
					"A Tale of Two Cities", "찰스 디킨스",
					"1859", "예약 가능",
					null, null,
					" 1859년 발표. T.칼라일의 《프랑스혁명》(1837)을 읽고 자극받은 작자가 프랑스혁명을 배경으로 런던과 파리를 무대로 하여 쓴 역사소설이다. 의사 마네트는 한 프랑스 귀족의 비밀을 우연히 알게 된 죄로 18년간이나 바스티유 감옥에 갇혀 있다가 석방되어 런던으로 건너간다.그의 딸 루시를 사랑하는 대니는 그 프랑스 귀족의 조카였으며, 잔인무도한 프랑스의 귀족제도가 싫어서 영국으로 건너와 영국식 이름으로 변명(變名)하고 있던 청년이다. 루시를 남몰래 사랑하고 있던 또 다른 한 청년, 주정뱅이 변호사 카튼은 사랑하는 사람을 위하여 혁명정부에 의해서 처형당하게 된 대니를 대신하여 죽는다. 특별히 명확한 정치적 입장이나 역사관에 입각하여 혁명을 묘사한 것은 아니지만, 파란만장한 플롯과 긴박한 파리와 런던의 정경 묘사가 탁월한 작품이다.",
					null),
			new BookItem(
					1151,"어린 왕자",
					"Le Petit Prince", "앙투안 드 생텍쥐페리",
					"1943", "예약 가능",
					null, null,
					"1943년 발표. 사막에 불시착한 비행사인 나는 이상한 소년을 만나 양을 그려 달라는 부탁을 받는다. 그 소년은 애인인 장미꽃을 자신이 사는 별에 남겨 두고 여행길에 오른 왕자로서 몇몇 별을 순례한 후에 지구에 온 것이다. 외로운 왕자에게 한 마리의 여우가 나타나서, 본질적인 것은 눈에 보이지 않는다는 것, 또한 다른 존재를 길들여 인연을 맺어 두는 일이 중요하다는 것을 가르친다. 왕자는 이 세계 속에서 자기가 책임을 져야만 하는 장미꽃이 존재한다는 사실에 깊은 뜻이 있음을 깨닫는다. 시적이며 고귀한 분위기 속에 지혜를 짜낸 휴머니스틱한 작품이다.",
					null),
			new BookItem(
					1152,"반지의 제왕",
					"The Lord of the Rings", "J. R. R. 톨킨",
					"1954", "예약 중",
					null, null, 
					"영국의 영문학자이자 소설가 J. R. R. 톨킨이 1950년대에 발표한 판타지 소설.이 작품의 전작인 <호빗>은 집필 당시에 그 자체로 완결성을 지니는 소품이었고, 그 당시에는 후기 톨킨의 방대한 세계관의 극히 일부가 조짐처럼 반영되어 있을 뿐이었다. 하지만 반지의 제왕을 집필하면서 톨킨은 언어학자인 자신의 특기를 살려 하나의 언어, 하나의 살아 숨쉬는 세계의 역사를 창조하여 반영하고자 했고, 결과적으로 반지의 제왕은 톨킨의 레젠다리움이 반영되어 전작에 비해 디테일한 묘사, 역사 등이 훨씬 강화된 다른 스케일의 작품이 되었다.  ",
					null),
			new BookItem(
					1153,"그리고 아무도 없었다",
					"And Then There Were None", "애거사 크리스티",
					"1939", "예약 가능",
					null, null, 
					"1972년, 애거서 크리스티가 자신의 10대 작품 중 하나로 선정하였고,얼릭 노먼 오언'이라는 갑부가 얼마 전 구매한 작은 섬인 '인디언 섬(니거 섬, 병정 섬)'에 8명의 남녀가 각각의 사연으로 초대를 받는다. 하지만 손님들이 도착한 인디언 섬에는 얼릭 노먼 오언도 그 부인도 없었고, 오직 그들에게 고용된 하인 부부 두 명만이 기다리고 있었다. 하인들은 주인이 사정이 있어 늦어지니 손님들을 접대하라는 지시를 받고 있었다.하지만 곧 이상한 사실이 밝혀지는데, 초대받은 손님들은 물론이고 하인 부부까지 합쳐서 섬에 있는 열 명의 남녀들 중 누구도 주인 부부를 알거나 직접 만나본 사람이 없었다. 손님들은 제각기 알고 있는 다른 이름으로 초청을 받았고, 저녁 식사가 끝난 뒤 모두가 모인 응접실에 정체 불명의 목소리가 울려퍼진다. 그 목소리는 열 사람이 각각 과거에 저지른,범죄들을 하나씩 열거한다.",
					null),
			new BookItem(
					1154,"호빗",
					"The Hobbit", "J. R. R. 톨킨", 
					"1937", "예약 가능", 
					null, null, 
					"J. R. R. 톨킨이 1937년에 출판한 동화로, 반지의 제왕의 전편이라고 할 수 있다. 그가 만든 작품들의 총칭인 레젠다리움의 시작이기도 하다.톨킨이 시험지를 채점을 하다 백지를 낸 학생의 답안을 마주하고, 그 때 잠시 쉬게 된다. 그 때 영감이 떠올라 그 종이에 쓴 문장이 지금의 호빗 첫 문장. 지금까지도 톨킨이 쓴 문장 중 사실상 가장 상징적인 문장이 됐다.빌보, 간달프와, 소린을 비롯한, 훗날 소린의 12가신이라 불릴 난쟁이들 따라 모험을 떠나는 내용",
					null),
			new BookItem(
					1155,"홍루몽", 
					"紅樓夢", "조설근", 
					"1791", "예약 가능", 
					null, null, 
					"『홍루몽(紅樓夢)』을 언급하면 중국에서는 \"무궁무진하게 쏟아져 나오는 화제의 원천\"이라고들 말한다. 어느 곳이든 중국인이 모인 자리에서는 이 책이 한번 거론되기만 하면 순식간에 화제의 중심으로 떠올라 좌중의 분위기를 흥분시킨다. 사실 『홍루몽』은 간단히 말하면 그저 한편의 소설일 뿐이다. 하지만 지난 2백여 년 동안 근ㆍ현대의 중국인들에게 『홍루몽』은 소설 이상의 그 무엇이었다. 이 작품을 '만리장성과도 바꿀 수 없는 중국인의 자존심'이라고까지 말하는 사람도 있다. 게다가 어떻게 하여 감히 '경학(經學)'에 빗대는 말로, 일개 소설을 연구하는 학문을 일컬어 '홍학(紅學)'이라고 말하게 되었을까? 또 그 홍학은 어떻게 하여 20세기 초엽부터 중국은 물론 세계를 떠들썩하게 하였던 갑골학(甲骨學) 및 돈황학과 더불어 3대 현학(顯學)1)의 하나로 자리 잡을 수 있었을까?",
					null),
			new BookItem(
					1156,"나니아 연대기: 사자, 마녀 그리고 옷장", 
					"The Lion, the Witch and the Wardrobe", "C. S. 루이스", 
					"1950", "예약 중", 
					null, null, 
					"《나니아 연대기》는 전 세계 41개 언어 번역, 1억 부 이상의 판매고를 올린 베스트셀러로, 톨킨의 <반지의 제왕> 시리즈, 르 귄의 <어스시의 마법사> 시리즈와 함께 세계 3대 판타지 소설 중 하나로 꼽히는 대작이다. 또한, 미국 타임지가 선정한 ‘100대 영어 소설’에 시리즈의 가장 첫 번째 작품 <사자와 마녀와 옷장>이 선정되고, <마지막 전투>는 출간 직후 카네기 상을 수상하며 문학적 성과를 확인하기도 했다. 뿐만 아니라, 2005년부터 <사자와 마녀와 옷장>, <캐스피언 왕자>, <새벽출정호의 항해>가 차례로 영화화 되었으며, 2018년에는 넷플릭스 오리지널 시리즈 제작이 확정되었다.",
					null),
			new BookItem(
					1157,"그녀", 
					"She", "헨리 라이더 해거드",
					"1887", "예약 가능",
					null, null, 
					"국내에서는 오랫동안 「동굴의 여왕」이란 제목의 아동용 모험 소설로 알려져 왔던 이야기. 프로이트와 융이 즉각 몰두한 풍부한 상징 속에, 강력한‘여성 지배자’에 대한 인간의 원형적 욕망과 두려움을 담은 소설.",
					null),
			new BookItem(
					1158,"다빈치 코드", 
					"The Da Vinci Code", "댄 브라운", 
					"2003", "예약 가능",
					null, null, 
					"댄 브라운의 세계적인 베스트셀러『다빈치 코드』제1권. 전 세계 50여 개 언어로 번역되어 많은 사랑을 받고 있는 이 소설은 64주 연속 '뉴욕타임스' 베스트셀러 1위, 145주 연속 '뉴욕타임스' 베스트셀러에 오르는 기록을 세우기도 했다. 이번 한국어판은 기존의 번역 오류 문제를 해결하기 위해 원작의 참맛을 살린 새로운 번역으로 선보이는 완역판이다.",
					null),
			new BookItem(
					1159,"생각하라 그리고 부자가 되어라",
					"Think and Grow Rich", "나폴레옹 힐", 
					"1937", "예약 가능", 
					null, null, 
					"“Think and Grow Rich!” 성공철학 역사상 가장 많은 사람을 변화시킨 성공철학서의 걸작, ‘21세기 업그레이드 에디션’ 탄생! ★★★ 전 세계 1억 2천만 부 누적 판매! ★★★ ★★★ 나폴레온 힐 최고의 책! ★★★ 최초로 부자의 마인드셋을 정리한 나폴레온 힐의 저서,《생각하라 그리고 부자가 되어라(Think and Grow Rich)》가 21세기 에디션으로 새롭게 탄생했다. 당대의 자수성가한 부자 507명을 인터뷰해 그들의 성공 비결을 정리한 이 책은, 출간된 해에 100만 부 이상 팔리면서 성공철학서의 신화를 쓰기 시작했다. 지금까지 다양한 판본으로 전 세계 1억 2천만 부가 팔렸고, 역사상 가장 많은 사람들을 변화시킨 성공철학서의 걸작으로 평가받는다.",
					null),
			new BookItem(
					0001,"호밀밭의 파수꾼",
					"The Catcher in the Rye", "J. D. 샐린저",
					"1951", "예약 가능",
					null, null, 
					"1951년에 발표된 장편소설이다. 작가의 체험을 소재로 쓴 성장소설이다. 퇴학당한 한 소년이 허위와 위선으로 가득찬 세상에 눈떠가는 과정을 10대들이 즐겨 쓰는 속어와 비어를 사용하여 사실적으로 묘사한 점이 특징이다.문제아 홀든 콜필드가 집으로 돌아가기까지 3일 동안의 기록이 소설의 주요 줄거리이다. 열여섯 살의 홀든 콜필드는 네번째 다니던 고등학교에서 퇴학당하고 뉴욕의 거리를 헤맨다. 퇴학 사유는 성적불량이지만 그 심층에는 소년에서 성인으로 넘어가는 성장과정의 혼란이 자리하고 있다. 그에게는 고문 변호사인 아버지와 피비라는 여동생, 할리우드에서 시나리오 작가로 활동하는 형이 있다. 부유한 계층에 속해 있는 주인공은 현대사회의 추악한 속물 근성과 지식인 계층의 위선에 염증을 느낀다.",
					null),
			new BookItem(
					0004,"연금술사",
					"O Alquimista", "파울루 코엘류",
					"1988", "예약 중", 
					null, null, 
					"브라질의 대표적 작가 가운데 한 사람인 파울로 코엘료(Paulo Coelho, 1947~)의 장편소설로 1988년 출간되었다. 양치기 청년이 꿈의 계시를 따라 '자신의 보물'을 찾아가는 여정을 그리고 있다.책 읽기를 좋아하고, 세상 구경을 하기 위하여 양치기가 된 청년 산티아고는 한 아이가 자신을 이집트의 피라미드로 데려가는 꿈을 연속해서 꾼다. 산티아고는 그 꿈을 실현하기 위하여 긴 여행길에 오른다. 그 여정에서 산티아고는 집시 여인과 늙은 왕을 만나고, 도둑을 만나 빈털터리가 되기도 하고, 사랑하는 여인을 만나기도 하고, 사막에서 죽음의 문앞에 이르기도 하고, 현실에 안주하고 싶은 유혹에도 끌리지만, 꿈을 계속 쫓아가라는 연금술사의 충고를 따라 마침내 '자신의 보물'을 찾게 된다",
					null),
			new BookItem(
					1549,"정로의 계단",
					"Steps to Christ", "엘런 G. 화이트",
					"1892", "예약 중",
					null, null, 
					"정보 없음",
					null),
			new BookItem(
					8789,"롤리타",
					"Lolita", "블라디미르 나보코프",
					"1955", "예약 가능",
					null, null, 
					"파리 출생인 37세 중년 남자이며 문학 강사인 주인공 험버트는 미국 뉴저지에 방을 얻어 생활 하던 중, 하숙집 여주인 샬로트의 열두 살 난 외동딸인 말괄량이, 야생마 같은 이미지의 롤리타에게 첫눈에 사랑을 느끼게 되고, 그녀의 곁에 있기 위해 샬로트와 결혼한다.",
					null),
			new BookItem(
					0010,"하이디",
					"Heidis Lehr- und Wanderjahre", "요하나 슈피리", 
					"1880", "예약 가능",
					null, null, 
					"스위스의 여성아동문학가 요하나 슈피리(Johanna Spyri, 1827년 6월 12일 ~ 1901년 7월 7일)가 1880년과 1881년에 각각 발표한 2부작 소설.고아이지만 밝고 명랑한 알프스의 소녀 하이디의 성장 이야기를 다룬 기독교 고전 문학이다. 처음에는 익명으로 발표했다.",
					null),
			new BookItem(
					0011,"빨간 머리 앤",
					"Anne of Green Gables", "루시 몽고메리",
					"1908", "예약 가능",
					null, null, 
					"캐나다의 작가 루시 모드 몽고메리가 지은 소설로 1908년 출판되었다. 소설의 배경은 캐나다에서 가장 작은 주인 프린스 에드워드 아일랜드 섬이다.소설 속 주요 배경지인 캐나다의 프린스 에드워드 아일랜드 또한 작가 자신이 어린 시절을 보냈던 곳이다. 또한 이 소설은 1979년 일본에서 방영한 세계명작극장 시리즈를 통해, 일본, 한국, 대만[3] 등에서 더 인기가 많은 작품이기도 하다. 당연히 본고장인 영미권에서도 고전이라고 불리는 소설이다. ",
					null),
			new BookItem(
					0012,"흑마 이야기",
					"Black Beauty: His Grooms and Companions: The autobiography of a horse", "안나 슈엘",
					"1877", "예약 가능",
					null, null,
					"1820년 영국 노포크의 독실한 기독교 집안에서 태어났다. 어머니 메리 라이트 슈얼은 시인이자 작가였다. 어린 시절 학교가 끝나고 집으로 돌아오는 길에 다리를 심하게 다쳤는데, 치료가 잘못되는 바람에 평생을 불편한 채로 살아야 했다. 그때부터 계속 말을 타고 다니면서 말에게 깊은 관심과 사랑을 가지게 되었다. 1871년, 앞으로 얼마 못 산다는 선고를 받고는 죽기 전에 말을 위한 책을 써야겠다고 결심한다. 그 뒤 책을 쓰는 동안 건강이 몹시 악화되어 침대에 누운 채로 낭독을 하거나 간신히 몇 줄을 쓰면 그녀의 어머니가 옮기는 과정을 거치면서 6년 만에 책을 완성했으나 얼마 뒤에 세상을 떠나고 만다.",
					null),
			new BookItem(
					0013,"장미의 이름",
					"Il Nome della Rosa", "움베르토 에코",
					"1980", "예약 가능",
					null, null, 
					"1327년, 영국의 수도사 윌리엄은 그를 수행하는 아드소와 함께 모종의 임무를 띠고 이탈리아의 어느 수도원에 잠입한다. 수도원에서는 상상을 초월하는 끔찍한 연쇄 살인이 〈묵시록〉의 예언에 따라 벌어지고 있었고, 사건의 열쇠를 쥔 책은 그들 눈앞에서 연기처럼 사라져 버린다. 그리고 마침내 미궁을 꿰?는 거대한 암호를 풀어낸 윌리엄은 어둠 속에서 수도원을 지배하는 광신의 정체를 응시하게 되는데…….",
					null),
			new BookItem(
					0014,"독수리는 내리다",
					"The Eagle Has Landed", "잭 히긴스",
					"1975", "예약 가능",
					null, null,
					"전쟁은 많은 ‘스토리’를 남긴다. 잭 히긴스는 1929년 북아일랜드 벨파스트에서 태어난 영국의 소설가이다. 그리고 이 책 ‘독수리는 내리다 The Eagle Has Landed’(1975)는 세계적으로 5천만권 이상이 팔린 베스트셀러이자 대표작이다. 1977년 영화로도 제작되었다. 마이클 케인, 도널드 서덜랜드, 로버트 듀발 등이 출연했다.", 
					null),
			new BookItem(
					0015,"워터십 다운의 열한 마리 토끼",
					"Watership Down", "리처드 애덤스",
					"1972", "예약 가능",
					null, null,
					"흔히 생각하는 토끼에 대한 겁쟁이, 귀염둥이 등의 이미지에서 벗어나 다양한 성격의 토끼들이 등장한다. 작중의 토끼들은 집단 내에서 서로 다른 계급과 역할을 맡아 살아가며, 고유한 신화와 언어를 갖고 있다. 다만 일반적인 수인처럼 사람과 같은 문화가 아니라, 먹이사슬의 밑바닥에 놓인 토끼의 생태에 대한 고증[2]을 바탕으로 특유의 사고 방식과 행동 양식을 묘사했다. 여기에 나오는 토끼들은 당근이나 양배추를 좋아하고 암토끼를 위해서는 친구인 동료라도 싸울 동물다운 면도 여전히 있다. ",
					null),
			new BookItem(
					0016,"하이트 보고서",
					"The Hite Report", "셰어 하이트",
					"1976", "예약 가능",
					null, null, 
					"이 책의 저자인 쉐어 하이트는 설문조사를 통해 자신의 연구 결과를 밝혔다. 10만명 이상의 여성에게 보낸 설문조사는 3000명이 응답하는 데에 그쳤지만 이들의 답변을 기초로 쉐어 하이트는 이전까지는 쉬쉬하던 진실을 밝힌다. 많은 여성은 오르가즘을 경험하지 못한다. 지금은 당연시되는 이 말(진짜?)이 그 때에는 매우 파격적이었고 이 책은 베스트셀러에 오른다. ", 
					null),
			new BookItem(
					0017,"진저맨",
					"The Ginger Man", "J. P. 돈리비", 
					"1955", "예약 가능", 
					null, null, 
					"아일랜드 더블린의 트리니티 칼리지 법대생인 시배스천 데인저필드. 더블린 생활에 적응하지 못하고 적응할 마음도 없는 그는 무기력하고 불량한 스물일곱 살의 청년이다. 처자식은 내팽개친 채 술과 여자에만 빠져 사는 그의 삶엔 눈치, 배려, 신뢰와 책임감 대신 여인의 육체를 탐하는 기쁨, 섹스의 기쁨, 술의 기쁨 등 쾌락만이 존재할 뿐이다. 아무 일도 하지 않고, 아무 책임도 지지 않고, 아무것도 소유하지 않는 것을 인생 최대 목표로 삼고 살아가던 그는 영국으로 떠나 임종한 아버지의 유산만을 기다리는데…", 
					null),
			new BookItem(
					6878,"피터 래빗 이야기", 
					"The Tale of Peter Rabbit", "베아트릭스 포터", 
					"1902", "예약 가능", 
					null, null, 
					"베아트릭스 포터는 날카로운 통찰력으로 의인화된 동물들을 자연스럽게 묘사했다. 생생하게 살아 숨쉬는 ‘피터 래빗 전집’ 속 동물 주인공들은 각양각색의 인간 군상을 대변한다. 늑대에게 알을 빼앗길 뻔한 바보 오리, 다람쥐들이 바치는 뇌물을 받아 챙기는 올빼미, 그런 올빼미를 놀려대는 다람쥐, 이득이 없어지자 가난한 주인을 속여서 복수하는 고양이 등은 귀엽거나 혹은 나쁘거나 하는 지극히 ‘인간적인’ 모습으로 즐거움과 함께 우리를 돌아보게 한다. 그리고 작가의 말처럼 ‘삶의 이야기를 아주 조금밖에 이해하지 못하는’ 우리들은 아이러니하게도 다양한 동물 이야기를 통해 현실을 조금 더 가깝게 느낄 수 있다. 귀여운 말썽꾸러기 토끼, 그리고 다른 동물들과의 교감을 통해 지친 마음을 힐링할 수 있는 아름다운 스토리를 1909년 초판본 느낌을 그대로 살린 더스토리 《패브릭 피터 래빗 이야기》로 만나보자.", 
					null),
			new BookItem(
					3339,"해리 포터와 죽음의 성물",
					"Harry Potter and the Deathly Hallows", "J. K. 롤링",
					"2007", "예약 가능", 
					null, null, 
					"1997년 영국에서 출간된 이래 《해리 포터》 시리즈는 지금까지 200개국 이상 80개의 언어로 번역되고 출간되어 5억 부 이상을 판매했다. 국내에서도 1999년 《해리 포터와 마법사의 돌》의 출간을 필두로 지금까지 1,500만 부가 판매되었으며, 현재에도 독자들에게 변함없는 사랑을 받고 있다. 이 시리즈는 여덟 편의 영화로도 제작되어 전 세계 곳곳에서 흥행을 거두었고, 영화와 관련된 새로운 도서가 출간되고 테마 파크가 조성되는 등 놀라운 기현상을 빚어냈다.", 
					null),
			new BookItem(
					0020,"갈매기의 꿈", 
					"Jonathan Livingston Seagull", "리처드 바크", 
					"1970", "예약 가능", 
					null, null, 
					"조나단 리빙스턴은 단지 먹이를 구하기 위해 하늘을 나는 다른 갈매기와는 달리 비행 그 자체를 사랑하는 갈매기이다. 멋지게 날기를 꿈꾸는 조나단은 진정한 자유와 자아실현을 위해 고단한 비상의 꿈을 꾼다. 조나단의 이러한 행동은 갈매기사회의 오랜 관습에 저항하는 것으로 여겨져 다른 갈매기들로부터 따돌림을 받게 되고 끝내 그 무리로부터 추방당하게 된다.",
					null),
			new BookItem(
					0021,"가르시아 장군에게 보내는 편지", 
					"A Message to Garcia", "엘버트 허버드", 
					"1899", "예약 가능", 
					null, null, 
					"스스로 시대의 '변화'와 '과제'에 도전하고, 조금씩일지라도 '결과'를 이끌어내며 새로운 세계를 개척하는 사람의 모습을 제시한 자기경영서. 미국은 쿠바를 둘러싸고 스페인과 전쟁을 벌이고 있던 당시, 쿠바의 깊은 밀림 속에 숨어 지내는 반 스페인군 지도자 가르시아 장군에게 대통령의 편지를 전해야 했다. 이 책은 가르시아 장군에게 편지를 전하는 임무를 훌륭히 수행해낸 장교 '로완'의 영웅담을 이용해 우리 사회에 로완과 같은 인물이 얼마나 필요한지를 짧은 이야기로 만든 책이다.",
					null),
			new BookItem(
					0022,"소피의 세계", 
					"Sofies verden", "요스테인 고르데르", 
					"1991", "예약 가능", 
					null, null, 
					"책은 노르웨이의 작은 마을에 살고 있는 14살 소녀 소피가 의문의 편지를 받으면서 시작된다. “너는 누구니?”라고 쓰인 편지를 보낸 사람은 스스로를 ‘철학자’라고 소개하며 곧장 소피와 철학에 대해 이야기를 나눈다. 저자는 이처럼 많은 문제를 통해 독자가 평소 생각하지 못했던 철학적 질문을 스스로에게 묻고 답하게 하면서 자연스럽게 철학적 삶과 태도에 대한 동경을 불러일으킨다.",
					null),
			new BookItem(
					0023,"천사와 악마", 
					"Angels and Demons", "댄 브라운", 
					"2000", "예약 가능", 
					null, null, 
					"『천사와 악마』는 첨단과학과 바티칸 교황청의 충돌, 비밀결사 조직 일루미나티의 부활 등 흥미로운 소재를 정교하게 결합한, 댄 브라운이 퍼즐의 대가임을 입증하는 소설이다. 긴박감 넘치는 스토리 전개에 독자의 두뇌를 자극하는 지적 추리를 결합하여 결말이 드러날 때까지 결코 『천사와 악마』라는 작품으로부터 눈을 떼지 못하게 만드는 반전과 충격의 연속이다. 『천사와 악마』는 철저한 자료 조사와 심장을 고동치게 하는 서사가 돋보이는 대작 스릴러로, 마치 블록버스터 영화를 보는 것처럼 머릿속에 생생하게 그려지는 생생한 묘사와 웅장한 스케일을 자랑하기도 한다.",
					null),
			new BookItem(
					0024,"강철은 어떻게 단련되었는가", 
					"Как закалялась сталь", "니콜라이 오스트롭스키", 
					"1932", "예약 가능", 
					null, null, 
					"《강철은 어떻게 단련되었는가》는 제1차 세계대전, 러시아 혁명, 국내전, 네프(신경제정책)라는, 질풍노도 시대를 배경으로 만들어졌다. 이 커다란 국가적 변동기에 한 가난한 소년 직공 파벨 코르차긴이 콤소몰 회원으로서 정치적으로 눈떠, 조국의 새로운 현실에 대한 애정에 불타면서 다시 태어나는 과정을 자전적으로 그리고 있다.",
					null),
			new BookItem(
					0025,"전쟁과 평화", 
					"Война и мир", "레프 톨스토이", 
					"1869", "예약 가능", 
					null, null, 
					"레프 톨스토이의 『전쟁과 평화』는 1805년부터 1820년까지 약 15년의 시간과 러시아라는 광활한 공간을 배경으로 자연의 섭리와 인간의 역사를 그려 낸 그의 대표작이다. 559명의 등장인물, 큰 전쟁에 얽힌 방대한 서사에 자연스러운 리듬을 부여하는 작법뿐 아니라 피비린내 나는 전장에서 인간들의 운명을 냉엄하게 내려다보는 시선은 『일리아스』에 비견되는 서사시적 웅장함을 느끼게 한다. 지독한 허무주의자 안드레이, 부유하고 방탕한 상속자 피에르, 치명적인 유혹에 빠진 나타샤가 저마다의 시련을 극복하고 자기 안의 우주적 자아를 발견하는 과정은 각 인물들의 성장기인 동시에 전쟁과 수치를 겪으며 새로운 정체성을 자각해 나가는 러시아 자체의 성장 소설이기도 하다.",
					null)
	};
	
	public BookItem[] getCurrentAll() {
		return this.item;
	}
	
	public BookItem getCurrent() {
		return this.item[0];
	}
}
